## Terraform Plan — DEV Environment

| Step     | Result |
|----------|--------|
| Format   | ✅ `success` |
| Validate | ✅ `success` |
| Plan     | ✅ `success` |

<details><summary>📄 Show Plan Output</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.data.aws_availability_zones.available: Reading...
module.eks.data.aws_iam_policy_document.eks_cluster_assume_role_policy: Reading...
module.eks.data.aws_iam_policy_document.eks_node_assume_role_policy: Reading...
module.ecr.aws_ecr_repository.this["training"]: Refreshing state... [id=dev/kltn-project-dev-training]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-083559d82e7d1998e]
module.ecr.aws_ecr_repository.this["serving"]: Refreshing state... [id=dev/kltn-project-dev-serving]
module.eks.data.aws_iam_policy_document.eks_cluster_assume_role_policy: Read complete after 0s [id=3552664922]
module.eks.aws_cloudwatch_log_group.eks_cluster_logs: Refreshing state... [id=/aws/eks/mlops-infr-dev-eks/cluster]
module.bastion.data.aws_ami.ubuntu: Reading...
module.eks.aws_iam_role.eks_cluster_role: Refreshing state... [id=mlops-infr-dev-eks-cluster-role]
module.eks.data.aws_iam_policy_document.eks_node_assume_role_policy: Read complete after 0s [id=2851119427]
module.eks.aws_iam_role.worker_nodes_role: Refreshing state... [id=mlops-infr-dev-eks-worker-nodes-role]
module.eks.aws_iam_role_policy_attachment.worker_nodes_registry_policy: Refreshing state... [id=mlops-infr-dev-eks-worker-nodes-role-20260316141802710600000001]
module.eks.aws_iam_role_policy_attachment.worker_nodes_cni_policy: Refreshing state... [id=mlops-infr-dev-eks-worker-nodes-role-20260316141802751800000003]
module.eks.aws_iam_role_policy_attachment.worker_nodes_policy: Refreshing state... [id=mlops-infr-dev-eks-worker-nodes-role-20260316141802748100000002]
module.eks.aws_iam_role_policy_attachment.eks_cluster_policy: Refreshing state... [id=mlops-infr-dev-eks-cluster-role-20260316141802781700000004]
module.eks.aws_iam_role_policy_attachment.eks_vpc_resource_controller: Refreshing state... [id=mlops-infr-dev-eks-cluster-role-20260316141802814300000005]
module.vpc.data.aws_availability_zones.available: Read complete after 1s [id=ap-southeast-1]
module.ecr.aws_ecr_lifecycle_policy.this["serving"]: Refreshing state... [id=dev/kltn-project-dev-serving]
module.ecr.aws_ecr_lifecycle_policy.this["training"]: Refreshing state... [id=dev/kltn-project-dev-training]
module.bastion.data.aws_ami.ubuntu: Read complete after 1s [id=ami-0c1d28734eb221b6d]
module.vpc.aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0a796dcdebc263547]
module.vpc.aws_subnet.public_subnet["1"]: Refreshing state... [id=subnet-0e44f690cf3cdf64b]
module.security_group.aws_security_group.eks_control_plane: Refreshing state... [id=sg-08822865c37a74040]
module.vpc.aws_subnet.private_subnet["0"]: Refreshing state... [id=subnet-0862ed7a1f256f78c]
module.vpc.aws_subnet.private_subnet["1"]: Refreshing state... [id=subnet-0c207ad36ff9b9f98]
module.bastion.aws_security_group.allow_ssh: Refreshing state... [id=sg-03bea05fbf2f9ce4a]
module.vpc.aws_subnet.public_subnet["0"]: Refreshing state... [id=subnet-0da7bc7d5691b65cd]
module.security_group.aws_security_group.eks_worker_nodes: Refreshing state... [id=sg-0ea37c431f2417bc5]
module.vpc.aws_route_table.public_route_table: Refreshing state... [id=rtb-07748df0de9205335]
module.vpc.aws_eip.eip_nat["1"]: Refreshing state... [id=eipalloc-099b22b892bec040e]
module.vpc.aws_eip.eip_nat["0"]: Refreshing state... [id=eipalloc-05f68a7ba57a22e96]
module.bastion.aws_instance.bastion_host["0"]: Refreshing state... [id=i-0871801b469beb179]
module.bastion.aws_instance.bastion_host["1"]: Refreshing state... [id=i-0c0e856b9785f2fa8]
module.vpc.aws_route_table_association.public["0"]: Refreshing state... [id=rtbassoc-0613193a100866aaa]
module.vpc.aws_route_table_association.public["1"]: Refreshing state... [id=rtbassoc-0de446a40e9d9e5b5]
module.eks.aws_eks_cluster.main: Refreshing state... [id=mlops-infr-dev-eks]
module.security_group.aws_security_group_rule.control_plane_to_nodes_https: Refreshing state... [id=sgrule-1857319367]
module.security_group.aws_security_group_rule.control_plane_to_nodes_kubelet: Refreshing state... [id=sgrule-516971348]
module.security_group.aws_security_group_rule.nodes_to_control_plane_https: Refreshing state... [id=sgrule-1625178756]
module.eks.aws_launch_template.eks_nodes: Refreshing state... [id=lt-0c0325a97a4054d26]
module.vpc.aws_nat_gateway.nat_gateway["0"]: Refreshing state... [id=nat-0582d7dacbdbb2d80]
module.vpc.aws_nat_gateway.nat_gateway["1"]: Refreshing state... [id=nat-07709b8607d432b24]
module.vpc.aws_route_table.private_route_table["0"]: Refreshing state... [id=rtb-01fff17651ecaa893]
module.vpc.aws_route_table.private_route_table["1"]: Refreshing state... [id=rtb-08785455fa21ad6f5]
module.eks.aws_eks_node_group.main: Refreshing state... [id=mlops-infr-dev-eks:mlops-infr-dev-eks-node-group]
module.eks.data.tls_certificate.eks: Reading...
module.vpc.aws_route_table_association.private["1"]: Refreshing state... [id=rtbassoc-0c493e1a4a10a2825]
module.vpc.aws_route_table_association.private["0"]: Refreshing state... [id=rtbassoc-03d0a552a1c0c8026]
module.eks.data.tls_certificate.eks: Read complete after 1s [id=e612b2443a55ee2c98467bff460cf41a1094cd46]
module.eks.aws_iam_openid_connect_provider.eks: Refreshing state... [id=arn:aws:iam::255315173346:oidc-provider/oidc.eks.ap-southeast-1.amazonaws.com/id/7D25982407507CAAE753D5E4D3C9D149]
module.load_balancer_controller.aws_iam_policy.aws_load_balancer_controller: Refreshing state... [id=arn:aws:iam::255315173346:policy/mlops-infr-dev-eks-aws-load-balancer-controller]
module.load_balancer_controller.aws_iam_role.aws_load_balancer_controller: Refreshing state... [id=mlops-infr-dev-eks-aws-load-balancer-controller]
module.load_balancer_controller.aws_iam_role_policy_attachment.aws_load_balancer_controller_attach: Refreshing state... [id=mlops-infr-dev-eks-aws-load-balancer-controller-20260316142925722500000013]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.bastion.aws_instance.bastion_host["0"] will be updated in-place
  ~ resource "aws_instance" "bastion_host" {
        id                                   = "i-0871801b469beb179"
      ~ public_dns                           = "ec2-18-143-167-106.ap-southeast-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "18.143.167.106" -> (known after apply)
        tags                                 = {
            "Name" = "KLTN-Bastion-Host-1"
        }
      ~ user_data                            = "67e07d65a772bd9ad843fe3eb679a1e7ec45e0d8" -> "aded1d2aaa02fa63d4b9e89700f3d9aa2bf73187"
        # (37 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.bastion.aws_instance.bastion_host["1"] will be updated in-place
  ~ resource "aws_instance" "bastion_host" {
        id                                   = "i-0c0e856b9785f2fa8"
      ~ public_dns                           = "ec2-13-250-47-67.ap-southeast-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "13.250.47.67" -> (known after apply)
        tags                                 = {
            "Name" = "KLTN-Bastion-Host-2"
        }
      ~ user_data                            = "67e07d65a772bd9ad843fe3eb679a1e7ec45e0d8" -> "aded1d2aaa02fa63d4b9e89700f3d9aa2bf73187"
        # (37 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.load_balancer_controller.data.aws_iam_policy_document.aws_load_balancer_controller_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "aws_load_balancer_controller_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.ap-southeast-1.amazonaws.com/id/7D25982407507CAAE753D5E4D3C9D149:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ]
              + variable = "oidc.eks.ap-southeast-1.amazonaws.com/id/7D25982407507CAAE753D5E4D3C9D149:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::255315173346:oidc-provider/oidc.eks.ap-southeast-1.amazonaws.com/id/7D25982407507CAAE753D5E4D3C9D149",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.load_balancer_controller.aws_iam_role.aws_load_balancer_controller will be updated in-place
  ~ resource "aws_iam_role" "aws_load_balancer_controller" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ap-southeast-1.amazonaws.com/id/7D25982407507CAAE753D5E4D3C9D149:aud" = "sts.amazonaws.com"
                              - "oidc.eks.ap-southeast-1.amazonaws.com/id/7D25982407507CAAE753D5E4D3C9D149:sub" = "system:serviceaccount:kube-system:aws-load-balancer-controller"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::255315173346:oidc-provider/oidc.eks.ap-southeast-1.amazonaws.com/id/7D25982407507CAAE753D5E4D3C9D149"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "mlops-infr-dev-eks-aws-load-balancer-controller"
        name                  = "mlops-infr-dev-eks-aws-load-balancer-controller"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # module.security_group.aws_security_group.eks_control_plane will be updated in-place
  ~ resource "aws_security_group" "eks_control_plane" {
        id                     = "sg-08822865c37a74040"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Kubernetes API - HTTPS from worker nodes"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0ea37c431f2417bc5",
                ]
              - self             = false
              - to_port          = 443
            },
            # (1 unchanged element hidden)
        ]
        name                   = "KLTN-Project-DEV-eks-cp-20260316141817050000000007"
        tags                   = {
            "Name" = "KLTN-Project-DEV-eks-control-plane-sg"
        }
        # (8 unchanged attributes hidden)
    }

  # module.security_group.aws_security_group.eks_worker_nodes will be updated in-place
  ~ resource "aws_security_group" "eks_worker_nodes" {
        id                     = "sg-0ea37c431f2417bc5"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "HTTPS from EKS control plane (webhook aggregation)"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-08822865c37a74040",
                ]
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Kubelet API - from EKS control plane"
              - from_port        = 10250
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-08822865c37a74040",
                ]
              - self             = false
              - to_port          = 10250
            },
            # (5 unchanged elements hidden)
        ]
        name                   = "KLTN-Project-DEV-eks-nodes-20260316141817057400000008"
        tags                   = {
            "Name" = "KLTN-Project-DEV-eks-worker-nodes-sg"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.

Changes to Outputs:
  ~ bastion_public_ips                  = {
      ~ "0" = "18.143.167.106" -> (known after apply)
      ~ "1" = "13.250.47.67" -> (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```
</details>

---
> ✅ **Plan OK.** To apply, run the workflow [Terraform Apply](../.github/workflows/terraform-apply.yml) with:
> - **Environment:** `dev`
> - **Plan Commit SHA:** `b80e982d6a35c114d38e5e9d90fae45a727eb258`

> *Commit: `b80e982d6a35c114d38e5e9d90fae45a727eb258`*